package 주식정보시스템;

public class 복습문제 {

	public static void main(String[] args) {
//		1. 기본형 형변환 중, 아래 코드를 수정해보세요.
		   int x = 100;
		   byte y = (byte)x;
//		2. 참조형 형변환이 되는 조건은?
		   // 상속관계에서만? 
//		3. 상속에서 위에 물려주는 클래스를 무엇이라고 부르는가? 보모클래스
//		4. 상속에서 아래 물려받는 클래스를 무엇이라고 부르는가? 자식클래스
//		5. 상속을 사용할 때 키워드는 다음중 무엇? 1) extend 2) extends 3) implements // 2번
//		6. 기본형 데이터 4가지 . int double char boolean
//		7. 참조형 데이터 2가지 이상 String class
//		8. 참조형 형변환 중, 아래 코드를 수정해보세요.
//		   Car c = new Car();
//		   Truck t = new Truck(); //Truck은 Car를 상속받아 만들었음.
//		   t = (Truck)c; //수정해보세요.
//		9. 기본형, 참조형 변수에 각각 들어있는 것은? \기본형  참조형(주소)
//		10. 참조형 변수를 초기화하려고 한다. 무엇으로 초기화해야할까? null
//		11. null이란? 아무것도 없는 공백 쓰레기 값도 없음 주소가 없다!
//		12. 포장클래스(랩퍼클래스)란? 종류 2가지 업캐스팅 다운캐스팅
//		13. 업캐스팅이란? 박싱 int -> Integer -> Object //// 자동형변환
//		14. 다운캐스팅이란? 언박싱 Object -> Integer -> int ///// 강제형변환

	}

}
